In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os
import sys

if sys.platform == 'win32':
    dir = r"D:\黑马课程\人工智能V3.0（尊享无忧）\00 课程资料\3.阶段三数据处理与统计分析\数据处理与统计分析v3.0视频（第二部分）\资料"
else:
    dir = r'/Users/wangrui/Desktop/00 课程资料/3.阶段三数据处理与统计分析/数据处理与统计分析v3.0视频（第二部分）/资料'
os.chdir(dir)

In [3]:
df = pd.read_csv('data/gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [4]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [5]:
df.year.unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [6]:
df.groupby('continent').lifeExp.agg(np.mean)

continent
Africa      48.865330
Americas    64.658737
Asia        60.064903
Europe      71.903686
Oceania     74.326208
Name: lifeExp, dtype: float64

In [7]:
def my_mean(values):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    return sum / n
df.groupby('year').lifeExp.agg(my_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [8]:
def my_mean_diff(values, diff_value):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum / n
    return mean - diff_value

global_mean = df.lifeExp.mean()
df.groupby('year').lifeExp.agg(my_mean_diff, diff_value=global_mean)

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [9]:
#同时传入多个函数
df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std])

      count_nonzero       mean        std
year
1952          142.0  49.057620  12.225956
1957          142.0  51.507401  12.231286
1962          142.0  53.609249  12.097245
1967          142.0  55.678290  11.718858
1972          142.0  57.647386  11.381953
1977          142.0  59.570157  11.227229
1982          142.0  61.533197  10.770618
1987          142.0  63.212613  10.556285
1992          142.0  64.160338  11.227380
1997          142.0  65.014676  11.559439
2002          142.0  65.694923  12.279823
2007          142.0  67.007423  12.073021

In [10]:
#对不同字段进行不同聚合
df.groupby('year').agg({'lifeExp': 'mean', 'pop': 'median', 'gdpPercap': 'median'})

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334741
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371109

In [11]:
#对列重命名
df.groupby('year').agg({'lifeExp': 'mean', 'pop': 'median', 'gdpPercap': 'median'}).rename(columns={'lifeExp': '平均寿命', 'pop': '人口', 'gdpPercap': '人均Gdp'}).reset_index()

    year       平均寿命          人口        人均Gdp
0   1952  49.057620   3943953.0  1968.528344
1   1957  51.507401   4282942.0  2173.220291
2   1962  53.609249   4686039.5  2335.439533
3   1967  55.678290   5170175.5  2678.334741
4   1972  57.647386   5877996.5  3339.129407
5   1977  59.570157   6404036.5  3798.609244
6   1982  61.533197   7007320.0  4216.228428
7   1987  63.212613   7774861.5  4280.300366
8   1992  64.160338   8688686.5  4386.085502
9   1997  65.014676   9735063.5  4781.825478
10  2002  65.694923  10372918.5  5319.804524
11  2007  67.007423  10517531.0  6124.371109

In [12]:
#### transform转换
tips_10 = pd.read_csv('data/tips_10.csv')
tips_10

   Unnamed: 0  total_bill   tip     sex smoker   day    time  size
0          24       19.82  3.18    Male     No   Sat  Dinner     2
1           6         NaN  2.00    Male     No   Sun  Dinner     2
2         153         NaN  2.00    Male     No   Sun  Dinner     4
3         211       25.89  5.16    Male    Yes   Sat  Dinner     4
4         198         NaN  2.00  Female    Yes  Thur   Lunch     2
5         176       17.89  2.00    Male    Yes   Sun  Dinner     2
6         192         NaN  2.56    Male    Yes  Thur   Lunch     2
7         124       12.48  2.52  Female     No  Thur   Lunch     2
8           9       14.78  3.23    Male     No   Sun  Dinner     2
9         101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [13]:
tips_10.groupby('sex').count()

        Unnamed: 0  total_bill  tip  smoker  day  time  size
sex
Female           3           2    3       3    3     3     3
Male             7           4    7       7    7     7     7

In [14]:
def fill_na_mean(x):
    avg = x.mean()
    return x.fillna(avg)
total_bill_group_mean = tips_10.groupby('sex').total_bill.transform(fill_na_mean)
total_bill_group_mean

0    19.820
1    19.595
2    19.595
3    25.890
4    13.930
5    17.890
6    19.595
7    12.480
8    14.780
9    15.380
Name: total_bill, dtype: float64

In [15]:
tips_10['fill_total_bill'] = total_bill_group_mean
tips_10

,Unnamed: 0,total_bill,tip,sex,smoker,day,time,size,fill_total_bill
0,24,19.82,3.18,Male,No,Sat,Dinner,2,19.820
1,6,NaN,2.00,Male,No,Sun,Dinner,2,19.595
2,153,NaN,2.00,Male,No,Sun,Dinner,4,19.595
3,211,25.89,5.16,Male,Yes,Sat,Dinner,4,25.890
4,198,NaN,2.00,Female,Yes,Thur,Lunch,2,13.930
5,176,17.89,2.00,Male,Yes,Sun,Dinner,2,17.890
6,192,NaN,2.56,Male,Yes,Thur,Lunch,2,19.595
7,124,12.48,2.52,Female,No,Thur,Lunch,2,12.480
8,9,14.78,3.23,Male,No,Sun,Dinner,2,14.780
9,101,15.38,3.00,Female,Yes,Fri,Dinner,2,15.380

In [16]:
def my_zscore(x):
    """计算z分数"""
    return (x - x.mean()) / x.std()
df.groupby('year').lifeExp.transform(my_zscore)

0      -1.656854
1      -1.731249
2      -1.786543
3      -1.848157
4      -1.894173
          ...
1699   -0.081621
1700   -0.336974
1701   -1.574962
1702   -2.093346
1703   -1.948180
Name: lifeExp, Length: 1704, dtype: float64

In [17]:
# 过滤
tips = pd.read_csv('data/tips.csv')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [19]:
tips['size'].value_counts()

2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64

In [21]:
tips_filtered = tips.groupby('size').filter(lambda x: x['size'].count() > 30)
tips_filtered

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[231 rows x 7 columns]

In [22]:
tips_filtered['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [23]:
group_avg = tips_10.groupby(['sex','time']).mean()
group_avg

               Unnamed: 0  total_bill       tip      size  fill_total_bill
sex    time
Female Dinner       101.0      15.380  3.000000  2.000000           15.380
       Lunch        161.0      12.480  2.260000  2.000000           13.205
Male   Dinner        96.5      19.595  2.928333  2.666667           19.595
       Lunch        192.0         NaN  2.560000  2.000000           19.595

In [24]:
group_avg.index

MultiIndex([('Female', 'Dinner'),
            ('Female',  'Lunch'),
            (  'Male', 'Dinner'),
            (  'Male',  'Lunch')],
           names=['sex', 'time'])